# Exploratory Data Analysis of Global AI Job Market & Salary Trends 2025


AI Job Market Analysis Dataset 2025. Retrieved from Kaggle.com

https://www.kaggle.com/datasets/bismasajjad/global-ai-job-market-and-salary-trends-2025

Script created 2025-06-05 by PiotrUr

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
# Load the ai_job_dataset.csv
df = pd.read_csv("ai_job_dataset.csv")

In [6]:
#Check first rows of dataset
df.head()

,job_id,job_title,salary_usd,salary_currency,experience_level,employment_type,company_location,company_size,employee_residence,remote_ratio,required_skills,education_required,years_experience,industry,posting_date,application_deadline,job_description_length,benefits_score,company_name
0,AI00001,AI Research Scientist,90376,USD,SE,CT,China,M,China,50,"Tableau, PyTorch, Kubernetes, Linux, NLP",Bachelor,9,Automotive,2024-10-18,2024-11-07,1076,5.9,Smart Analytics
1,AI00002,AI Software Engineer,61895,USD,EN,CT,Canada,M,Ireland,100,"Deep Learning, AWS, Mathematics, Python, Docker",Master,1,Media,2024-11-20,2025-01-11,1268,5.2,TechCorp Inc
2,AI00003,AI Specialist,152626,USD,MI,FL,Switzerland,L,South Korea,0,"Kubernetes, Deep Learning, Java, Hadoop, NLP",Associate,2,Education,2025-03-18,2025-04-07,1974,9.4,Autonomous Tech
3,AI00004,NLP Engineer,80215,USD,SE,FL,India,M,India,50,"Scala, SQL, Linux, Python",PhD,7,Consulting,2024-12-23,2025-02-24,1345,8.6,Future Systems
4,AI00005,AI Consultant,54624,EUR,EN,PT,France,S,Singapore,100,"MLOps, Java, Tableau, Python",Master,0,Media,2025-04-15,2025-06-23,1989,6.6,Advanced Robotics

In [14]:
#Shape of Dataset
df.shape

(15000, 19)

In [8]:
#Data completeness verification
df.info()
#According to info() function there are no nulls in the dataset and data is complete

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15000 entries, 0 to 14999
Data columns (total 19 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   job_id                  15000 non-null  object
 1   job_title               15000 non-null  object
 2   salary_usd              15000 non-null  int64
 3   salary_currency         15000 non-null  object
 4   experience_level        15000 non-null  object
 5   employment_type         15000 non-null  object
 6   company_location        15000 non-null  object
 7   company_size            15000 non-null  object
 8   employee_residence      15000 non-null  object
 9   remote_ratio            15000 non-null  int64
 10  required_skills         15000 non-null  object
 11  education_required      15000 non-null  object
 12  years_experience        15000 non-null  int64
 13  industry                15000 non-null  object
 14  posting_date            15000 non-null  object
 15  application_deadline    15000 non-null  object
 16  job_description_length  15000 non-null  int64
 17  benefits_score          15000 non-null  float64
 18  company_name            15000 non-null  object
dtypes: float64(1), int64(4), object(14)
memory usage: 2.2+ MB

In [9]:
#Check Statistics for numerical columns
df.describe().T

,count,mean,std,min,25%,50%,75%,max
salary_usd,15000.0,115348.965133,60260.940438,32519.0,70179.75,99705.0,146408.5,399095.0
remote_ratio,15000.0,49.483333,40.812712,0.0,0.00,50.0,100.0,100.0
years_experience,15000.0,6.253200,5.545768,0.0,2.00,5.0,10.0,19.0
job_description_length,15000.0,1503.314733,576.127083,500.0,1003.75,1512.0,2000.0,2499.0
benefits_score,15000.0,7.504273,1.450870,5.0,6.20,7.5,8.8,10.0

In [11]:
#Check statistics for non-numerical columns
df.describe(include=[object]).T

                      count unique                          top   freq
job_id                15000  15000                      AI00001      1
job_title             15000     20  Machine Learning Researcher    808
salary_currency       15000      3                          USD  11957
experience_level      15000      4                           MI   3781
employment_type       15000      4                           FT   3812
company_location      15000     20                      Germany    814
company_size          15000      3                            S   5007
employee_residence    15000     20                       Sweden    790
required_skills       15000  13663  Python, TensorFlow, PyTorch     17
education_required    15000      4                     Bachelor   3789
industry              15000     15                       Retail   1063
posting_date          15000    486                   2024-07-05     51
application_deadline  15000    543                   2025-01-05     47
company_name          15000     16                 TechCorp Inc    980

In [12]:
#List column names for easier picking
df.columns

Index(['job_id', 'job_title', 'salary_usd', 'salary_currency',
       'experience_level', 'employment_type', 'company_location',
       'company_size', 'employee_residence', 'remote_ratio', 'required_skills',
       'education_required', 'years_experience', 'industry', 'posting_date',
       'application_deadline', 'job_description_length', 'benefits_score',
       'company_name'],
      dtype='object')

In [16]:
#Checking average values by job title
df.groupby(['job_title'],sort=True).mean()

,salary_usd,remote_ratio,years_experience,job_description_length,benefits_score
job_title,,,,,
AI Architect,117436.513619,49.416342,6.498054,1523.970169,7.459533
AI Consultant,113671.870739,49.928977,6.099432,1533.160511,7.445170
AI Product Manager,114680.909825,50.874832,6.086137,1502.460296,7.500942
AI Research Scientist,117897.925926,48.214286,6.403439,1496.533069,7.445238
AI Software Engineer,114273.201531,51.147959,6.227041,1503.077806,7.508929
AI Specialist,120570.758242,49.862637,6.561813,1499.346154,7.550000
Autonomous Systems Engineer,111396.557272,51.158301,6.088803,1498.553411,7.498584
Computer Vision Engineer,113472.707182,52.486188,5.954420,1489.910221,7.518370
Data Analyst,111321.180501,49.670619,5.956522,1476.571805,7.587484
Data Engineer,115970.720961,50.066756,6.289720,1500.174900,7.580908
Data Scientist,115819.008333,49.375000,6.337500,1459.533333,7.491389
Deep Learning Engineer,113725.632312,48.328691,6.075209,1526.263231,7.512396
Head of AI,118542.968627,47.058824,6.505882,1510.794771,7.596340
ML Ops Engineer,115431.335172,50.620690,6.292414,1498.158621,7.480966
Machine Learning Engineer,118827.919689,50.647668,6.722798,1513.288860,7.430570
Machine Learning Researcher,112621.747525,48.081683,6.094059,1518.023515,7.472277
NLP Engineer,112670.937008,50.393701,5.982940,1471.980315,7.524278
Principal Data Scientist,116305.219346,49.591281,6.128065,1519.377384,7.501499
Research Scientist,116066.502695,45.754717,6.264151,1537.301887,7.457817
Robotics Engineer,116470.793149,47.101449,6.475626,1487.898551,7.522530

In [19]:
#Since I am the most interested in Data Analyst role, let's check some descriptive statistics for this job title 

df_DA = df[df['job_title'] == 'Data Analyst']

df_DA.describe()

,salary_usd,remote_ratio,years_experience,job_description_length,benefits_score
count,759.000000,759.000000,759.000000,759.000000,759.000000
mean,111321.180501,49.670619,5.956522,1476.571805,7.587484
std,57745.818000,40.729134,5.404919,596.743891,1.459638
min,32542.000000,0.000000,0.000000,502.000000,5.000000
25%,69003.000000,0.000000,1.000000,942.000000,6.300000
50%,96074.000000,50.000000,4.000000,1460.000000,7.600000
75%,136232.000000,100.000000,9.000000,2009.000000,8.800000
max,361541.000000,100.000000,19.000000,2497.000000,10.000000